Autodesk.Revit.DB.PointClouds.PointCloudFilterFactory.CreateMultiPlaneFilter(System.Collections.Generic.IList{Autodesk.Revit.DB.Plane})
Creates a new point cloud filter based upon planar boundaries.
Remarks:
The filter will check whether a point is located on the "positive" side of each plane,
as indicated by the positive direction of the plane normal. Therefore, such filter implicitly defines a volume,
which is the intersection of the positive half-spaces corresponding to all the planes.
This volume does not have to be closed, but it will always be convex.
planes:
All planes used for filtering; positive direction of the normal should point inside the volume of interest.
Only points on the "positive" side of all planes will pass the filter.
Returns:
Filter object; can be used to get representative set of cloud points passing through the filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PointClouds.PointCloudFilterFactory.CreateMultiPlaneFilter(System.Collections.Generic.IList{Autodesk.Revit.DB.Plane},System.Int32)
Creates a new point cloud filter based upon planar boundaries.
Remarks:
The filter will check whether a point is located on the "positive" side of each plane,
as indicated by the positive direction of the plane normal. Therefore, such filter implicitly defines a volume,
which is the intersection of the positive half-spaces corresponding to all the planes.
This volume does not have to be closed, but it will always be convex.
planes:
All planes used for filtering; positive direction of the normal should point inside the volume of interest.
exactPlaneCount:
This value represents the number of planes (taken in order of their addition) which will be used
for exact filtering of individual points. Other planes in the filter will be used for faster,
but inexact filtering based on cells.
Returns:
Filter object; can be used to get representative set of cloud points passing through the filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PointClouds.PointCloudFilterFactory
A factory class for creating point cloud filters.
Since:
2012